nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z75m/common/pin_mux/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_ACCEL_INT2_FGPIO FGPIOJ             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_ACCEL_INT2_GPIO GPIOJ               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ACCEL_INT2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ACCEL_INT2_PORT PORTJ               /*!<@brief PORT peripheral base pointer */
#define BOARD_ACCEL_INT2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_ACCEL_INT2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

/*!
 * @brief
 * UART2 IrDA Select: Pad RX input PTI[6] or PTE[6] selected for RX input of UART2 and UART2 TX signal is not used
 * for modulation.
 */
#define MISC_CTL_UART2IRSEL_NONE 0x00u

/*! @name PORTI7 (number 7), UART2_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_TX_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTI6 (number 6), UART2_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_DEBUG_UART_RX_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEBUG_UART_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTE3 (number 85), J7[2]/Y2[1]/XTAL_8MHz
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_XTAL0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_XTAL0_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_XTAL0_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTE2 (number 84), J4[2]/Y2[3]/EXTAL_8MHz
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EXTAL0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_EXTAL0_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_EXTAL0_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name XTAL32 (number 33), Y1[1]/XTAL_32K
  @{ */
/* @} */

/*! @name EXTAL32 (number 34), Y1[2]/EXTAL_32K
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

/*! @name PORTG4 (number 114), J32[B10]/J15[1]/U4[5]/SPI0_MOSI
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_SI_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_SI_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_SI_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTG5 (number 115), J32[B11]/J13[2]/U4[2]/SPI0_MISO
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_SO_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_SO_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_SO_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*! @name PORTG3 (number 113), J32[B7]/J12[1]/U4[6]/SPI0_SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_CLK_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_CLK_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_CLK_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                 /* @} */

/*! @name PORTG2 (number 112), J32[B9]/J9[2]/U4[1]/SPI0_PCS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_FLASH_CS_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_FLASH_CS_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_FLASH_CS_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASHPins(void);

/*!
 * @brief
 * UART0 IrDA Select: UART0 selected for IrDA modulation.
 * UART0 TX modulated by XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13].
 * UARTxIRSEL cannot configure XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need extra configuration in
 * XBAR.
 * User should configure XBAR[14:13] accordingly.
 */
#define MISC_CTL_UART0IRSEL_IRDA 0x01u
/*!
 * @brief UART Modulation Type: TypeB (AND'ed) Modulation selected for IrDA */
#define MISC_CTL_UARTMODTYPE_TypeB 0x01u

/*! @name PORTL2 (number 129), J18[1]/J25[23]/IRDTJ/XBAR0_OUT10
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_IR_TX_PORT PORTL               /*!<@brief PORT peripheral base pointer */
#define BOARD_IR_TX_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_IR_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTD0 (number 61), J17[2]/J19[1]/J25[17]/D5/ORANGE/IRDRJ/CMP0_IN0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_IR_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_IR_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_IR_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitINFRA_REDPins(void);

