nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z75m/common/pin_mux/pin_mux.h
/*! @name PORTF1 (number 95), J21[1]/POT_5K
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC_POT_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC_POT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_ADC_POT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPOTENTIOMETERPins(void);

/*! @name PORTF2 (number 96), J20[1]/TEMP_SENSE
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_ADC_TEMP_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_ADC_TEMP_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_ADC_TEMP_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTEMP_SENSORPins(void);

/*! @name PORTB7 (number 26), DS1[1]/LCD_P38
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P38_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P38_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P38_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB5 (number 24), DS1[2]/LCD_P36
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P36_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P36_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P36_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB3 (number 22), DS1[3]/LCD_P34
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P34_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P34_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P34_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB1 (number 20), DS1[4]/LCD_P32
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P32_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P32_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P32_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB0 (number 16), DS1[5]/LCD_P31
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P31_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P31_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P31_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA6 (number 12), DS1[6]/LCD_P29
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P29_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P29_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P29_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA2 (number 8), DS1[7]/LCD_P25
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P25_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P25_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P25_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA0 (number 4), DS1[8]/LCD_P23
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P23_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P23_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P23_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTC4 (number 31), DS1[9]/LCD_P43
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P43_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P43_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P43_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB6 (number 25), DS1[10]/LCD_P37
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P37_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P37_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P37_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB4 (number 23), DS1[11]/LCD_P35
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P35_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P35_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P35_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB2 (number 21), DS1[12]/LCD_P33
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P33_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P33_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P33_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTJ2 (number 17), DS1[13]/LCD_P50
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P50_PORT PORTJ               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P50_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P50_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA7 (number 13), DS1[14]/LCD_P30
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P30_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P30_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P30_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTI5 (number 3), DS1[15]/LCD_P45
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P45_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P45_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P45_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA1 (number 5), DS1[16]/LCD_P24
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P24_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P24_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P24_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA3 (number 9), DS1[17]/LCD_P26
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P26_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P26_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P26_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTA5 (number 11), DS1[18]/LCD_P28
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P28_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P28_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P28_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

