nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z75m/common/pin_mux/pin_mux.h
/*! @name PORTI4 (number 143), DS1[19]/LCD_P44
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P44_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P44_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P44_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTL6 (number 142), DS1[20]/LCD_P59
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P59_PORT PORTL               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P59_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P59_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTL4 (number 140), DS1[21]/LCD_P57
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P57_PORT PORTL               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P57_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P57_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH4 (number 122), DS1[22]/LCD_P19
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P19_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P19_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P19_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG6 (number 116), DS1[23]/LCD_P13
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P13_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P13_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P13_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTL5 (number 141), DS1[24]/LCD_P58
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P58_PORT PORTL               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P58_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P58_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTL3 (number 139), DS1[25]/LCD_P56
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P56_PORT PORTL               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P56_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P56_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTI3 (number 131), DS1[26]/LCD_P22
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P22_PORT PORTI               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P22_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P22_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTH5 (number 123), DS1[27]/LCD_P20
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P20_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P20_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P20_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTG7 (number 117), DS1[28]/LCD_P14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_LCD_P14_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_LCD_P14_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_LCD_P14_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
